11/data/attachments/e0c2c98aec520a95.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>David_challenge_Actions_43542_0</nif:username>
            <nif:friendToBeRequested>soap_actions_d2fdd4cd-516f-43ae-b64a-916e779c92da</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>